Project/Toir/src/Catalogs/ИсходящиеСообщения/ИсходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИсходящиеСообщения</name>
  <attributes>
    <name>ДатаВремяСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УниверсальнаяДатаСобытияВМиллисекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаПубликации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючМаршрутизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверОчередей</name>
    <type>
      <types>CatalogRef.СерверыОчередейRMQ</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКлючСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорневойИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Хоп</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ОбъектСобытия</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_НастройкаПолучателя</name>
    <type>
      <types>CatalogRef.гкс_ПолучателиДанныхRMQ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСостав</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыгруженныеОбъекты</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/CommonModules/ОтправкаСообщений/Module.bsl
#Область СлужебныеПроцедурыиФункции

Процедура ПоФИФОИзОчередиИсходящих(ОтборСервер = Неопределено, 
	                                        ОтборТочкаПубликации = Неопределено, 
	                                        ОтборСообщения = Неопределено) Экспорт       	
	
	ИмяНастройки = "ИспользованиеОбработкиСообщенийПоТочкам";
	ИспользованиеОбработкиСообщенийПоТочкам = гкс_ОчередьСообщенийRMQПовтИсп.НастройкаИнтеграционногоАдаптера(ИмяНастройки);
	
	Если ИспользованиеОбработкиСообщенийПоТочкам Тогда
		
		ПоФИФОИзОчередиИсходящихПоТочкам();
		Возврат;
	
	КонецЕсли;
											
	гкс_ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания("ОтправкаИсходящихСообщений");

	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ гкс_ОчередьСообщенийRMQВызовСервера.ВключенОбменСRMQ() Тогда
		Возврат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СерверОчередей", ОтборСервер);
	Запрос.УстановитьПараметр("ТочкаПубликации", ОтборТочкаПубликации);	
	Запрос.УстановитьПараметр("МассивСообщений", ОтборСообщения);
	
	Запрос.Текст = Справочники.ИсходящиеСообщения.ТекстЗапросаИсходящиеСообщенияКОтправке(ОтборСервер,
                                                                                          ОтборТочкаПубликации,
																						  ОтборСообщения);
																						  
	ВыборкаВиртуальныйХост = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаВиртуальныйХост.Следующий() Цикл
		
		ВыборкаТочкаПубликации = ВыборкаВиртуальныйХост.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаТочкаПубликации.Следующий() Цикл
			
			Издатель = ПолучитьИздателяПоПараметрам(ВыборкаТочкаПубликации.ТочкаПубликации, 
			                                        ВыборкаТочкаПубликации.КлючСоединения, 
			                                        ВыборкаТочкаПубликации.ТипТочкиОбмена);			
			Если Издатель = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			Выборка = ВыборкаТочкаПубликации.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Сообщение = Новый Структура("СообщениеСсылка, 
				                            |СвойстваСообщения, 
											|НомерСообщения, 
											|КлючМаршрутизации, 
											|Сообщение");				
				ЗаполнитьЗначенияСвойств(Сообщение, Выборка);				
				ВыполнитьОбработкуСообщения(Издатель, Сообщение);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	                                                                             	
КонецПроцедуры	

#Область ЗапускОбработкиПоТочкам

Процедура ПоФИФОИзОчередиИсходящихПоТочкам() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	гкс_ТочкиОбменаRMQ.Наименование КАК ТочкаПубликации
	|ИЗ
	|	Справочник.гкс_ТочкиОбменаRMQ КАК гкс_ТочкиОбменаRMQ
	|ГДЕ
	|	гкс_ТочкиОбменаRMQ.ПометкаУдаления = ЛОЖЬ";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаТочекПубликации = РезультатЗапроса.Выбрать();

	Пока ВыборкаТочекПубликации.Следующий() Цикл
		Попытка
			ЗапуститьОбработкуИсходящихСообщенийДляТочки(ВыборкаТочекПубликации.ТочкаПубликации);				
		Исключение
		КонецПопытки
	КонецЦикла;

КонецПроцедуры

Процедура ЗапуститьОбработкуИсходящихСообщенийДляТочки(ТочкаПубликации) 
	
	Если Не ЗначениеЗаполнено(ТочкаПубликации) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыполнения = Новый Массив; 
	ПараметрыВыполнения.Добавить(ТочкаПубликации);  
	НаименованиеФЗ = СтрШаблон("Обработка очереди исходящих сообщений %1", ТочкаПубликации);
	ФоновыеЗадания.Выполнить("ОтправкаСообщений.ОбработатьИсходящиеСообщенияДляТочки", 
		ПараметрыВыполнения, 
		ТочкаПубликации,
		НаименованиеФЗ); 	
	
КонецПроцедуры

Процедура ОбработатьИсходящиеСообщенияДляТочки(ТочкаПубликации) Экспорт
	
	Если Не ЗначениеЗаполнено(ТочкаПубликации) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СерверОчередей", Неопределено);
	Запрос.УстановитьПараметр("ТочкаПубликации", ТочкаПубликации);	
	Запрос.УстановитьПараметр("МассивСообщений", Неопределено);
	
	Запрос.Текст = Справочники.ИсходящиеСообщения.ТекстЗапросаИсходящиеСообщенияКОтправке(Неопределено,
                                                                                          ТочкаПубликации,
																						  Неопределено);
																						  
	ВыборкаВиртуальныйХост = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаВиртуальныйХост.Следующий() Цикл
		
		ВыборкаТочкаПубликации = ВыборкаВиртуальныйХост.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаТочкаПубликации.Следующий() Цикл
			
			Издатель = ПолучитьИздателяПоПараметрам(ВыборкаТочкаПубликации.ТочкаПубликации, 
			                                        ВыборкаТочкаПубликации.КлючСоединения, 
			                                        ВыборкаТочкаПубликации.ТипТочкиОбмена);			
			Если Издатель = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			Выборка = ВыборкаТочкаПубликации.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Сообщение = Новый Структура("СообщениеСсылка, 
				                            |СвойстваСообщения, 
											|НомерСообщения, 
											|КлючМаршрутизации, 
											|Сообщение");				
				ЗаполнитьЗначенияСвойств(Сообщение, Выборка);				
				ВыполнитьОбработкуСообщения(Издатель, Сообщение);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция ПолучитьИздателяПоПараметрам(ТочкаПубликации, КлючСоединения, ТипТочкиОбмена) Экспорт
	
	Попытка
		
		Если ТипТочкиОбмена = ПредопределенноеЗначение("Перечисление.гкс_ТипыТочекОбменаRMQ.Fanout") Тогда	
			Издатель = ОчередьСообщений.НовыйИздатель(ТочкаПубликации, КлючСоединения);		
		ИначеЕсли ТипТочкиОбмена = ПредопределенноеЗначение("Перечисление.гкс_ТипыТочекОбменаRMQ.Direct") Тогда		
			Издатель = ОчередьСообщений.НовыйАдресныйИздатель(ТочкаПубликации, КлючСоединения);		
		Иначе		
			Издатель = ОчередьСообщений.НовыйТематическийИздатель(ТочкаПубликации, КлючСоединения);		
		КонецЕсли;
		
	Исключение
		
		ЗаписьЖурналаРегистрации(
		"ОтправкаСообщений.Ошибка",
		УровеньЖурналаРегистрации.Ошибка,
		,
		,
		"Ошибка инициализации адресного издателя: " + Символы.ПС + ОписаниеОшибки()
		);
		
		Издатель = Неопределено;
		
	КонецПопытки;

	Возврат Издатель;
	
КонецФункции

Процедура ВыполнитьОбработкуСообщения(Издатель, Сообщение)
	
	Перем СообщениеСсылка; 
		
	Сообщение.Свойство("СообщениеСсылка", СообщениеСсылка);
	
	НачатьТранзакцию();
	Попытка
		
		НеобходимоОтправитьВОчередь = Справочники.ИсходящиеСообщения.ОтметитьОтправкуСообщенияВОчередь(СообщениеСсылка);
		
		Если НеобходимоОтправитьВОчередь Тогда			
			// Подготовка и отправка через клиент - объект - обработкау "ИздательСобытий" 
			ОтправитьСообщениеВОчередь(Издатель, Сообщение);		
		КонецЕсли;
				
		ЗафиксироватьТранзакцию(); 	
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		ТекстОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ОтправкаСообщений.Ошибка",
		                         УровеньЖурналаРегистрации.Ошибка,
		                         ,
		                         ,
		                         ТекстОшибки);	
	КонецПопытки;
	
КонецПроцедуры

#Область Прочее

Процедура ОтправитьСообщениеВОчередь(Издатель, Сообщение)
	
	Перем СвойстваСообщения;
	Перем НомерСообщения;
	Перем КлючМаршрутизации;
	Перем СообщениеТекст;

	Сообщение.Свойство("СвойстваСообщения", СвойстваСообщения);
	Сообщение.Свойство("НомерСообщения", НомерСообщения);
	Сообщение.Свойство("КлючМаршрутизации", КлючМаршрутизации);
	Сообщение.Свойство("Сообщение", СообщениеТекст);

	СвойстваИздателя = ПолучитьСвойстваИздателяИзСвойствСообщения(СвойстваСообщения);
	ДополнитьСвойстваИздателя(СвойстваИздателя, НомерСообщения);
	УстановитьСвойстваИздателя(Издатель, СвойстваИздателя);
	Издатель.ОтправитьСообщение(СообщениеТекст, КлючМаршрутизации, 0, Истина);
	
КонецПроцедуры

Процедура ДополнитьСвойстваИздателя(СвойстваИздателя, НомерСообщения)
	
	Если ТипЗнч(СвойстваИздателя) = Тип("Структура") Тогда
		СвойстваИздателя.Вставить("НомерСообщения", НомерСообщения);		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСвойстваИздателяИзСвойствСообщения(СвойстваСообщения)
	
	Если ЗначениеЗаполнено(СвойстваСообщения) Тогда
		
		Попытка
			СвойстваИздателя = ЗначениеИзСтрокиВнутр(СвойстваСообщения);
		Исключение
			СвойстваИздателя = Неопределено;
		КонецПопытки;
		
		Возврат СвойстваИздателя;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура УстановитьСвойстваИздателя(Издатель, СвойстваИздателя)
	
	Издатель.СброситьЗначенияСвойств();
	
	Если ЗначениеЗаполнено(СвойстваИздателя) Тогда	
		Издатель.УстановитьСвойстваСообщения(СвойстваИздателя);			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
